channel395/system/wallShearStress
type            wallShearStress;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
